app/controllers/foods_controller.rb

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    @food = Food.find(params[:id])

INSERT INTO "foods" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Kripik Singkong Telur Asin"], ["created_at", "2017-10-22 07:27:12.490264"], ["updated_at", "2017-10-22 07:27:12.490264"]]
---
  def create
    food = Food.new(food_params)

    if food.save

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def edit
    @food = Food.find(params[:id])

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "foods" SET "name" = $1, "updated_at" = $2 WHERE "foods"."id" = $3  [["name", "Salted Egg Chicken Rice 23"], ["updated_at", "2017-10-22 07:52:49.927968"], ["id", 1]]
---
  def update
    food = Food.find(params[:id])
    if food.update(food_params)

DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 3]]
SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def destroy
    Food.find(params[:id]).destroy