app/controllers/restaurants_controller.rb

  def create
    restaurant = Restaurant.new(restaurant_params)

    if restaurant.save
---
INSERT INTO "restaurants" ("name", "address", "start_hour", "end_hour", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    restaurant = Restaurant.find(params[:id])
    if restaurant.update(restaurant_params)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "restaurants" SET "name" = $1, "address" = $2, "updated_at" = $3 WHERE "restaurants"."id" = $4  [["name", "Jualan Panutan Goreng"], ["address", "Jalan PanutanQ"], ["updated_at", "2017-11-22 06:30:01.721681"], ["id", 1]]