app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "huhu"], ["LIMIT", 1]]
---
  def create
    name = params[:name]
    password = params[:password]

    user = User.find_by(name: name)