app/controllers/users_controller.rb

  def create
    user = User.new(user_params)

    if user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at", "hashed_password") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "hore"], ["created_at", "2017-11-05 07:32:32.982507"], ["updated_at", "2017-11-05 07:32:32.982507"], ["hashed_password", "$2a$10$hYxPJNFyAu8WEn3juVozPur10w9kD8ouAeAyZAXM3FxqAwAR2p5ay"]]